wegam/STM32F10xUSBF/FWLIB/Lib/WOWLIB/SCR/STM32_SPI - 20170726.C
/******************************** User_library *********************************
* 文件名 	: STM32_SPI.H
* 作者   	: wegam@sina.com
* 版本   	: V
* 日期   	: 2016/01/01
* 说明   	: 
********************************************************************************
SPI配置
1）使用前需要配置结构体参数 SPI_ConfTypeDef
SPI_ConfTypeDef包含GPIO结构体（4个GPIO管脚），SPI结构体,DMA结构体，接收缓冲区，发送缓冲区，DMA使用与否标志

SPI需要配置基本内容：
1)GPIO
2)SPI
当使用DMA时：
3)DMA


*******************************************************************************/
#include "STM32_SPI.H"
#include "stm32f10x_dma.h"
#include "stm32f10x_exti.h"
#include "STM32_EXTI.H"

#include "STM32_WOW.H"
//#include "STM32F10x_BitBand.H"

char *SPI_BUFFER;
u32	SPI_BUFFERSIZE;
//#define	SPI_BUFFERSIZE	4

//char SPI_TX_Buffer[4]={0X9F,0X9F,0X9F,0X9F};
//char SPI_RX_Buffer[4]={0};
/*******************************************************************************
*函数名		:	SPI_Configuration
*功能描述	:	串口配置
*输入			:	MemoryAddr--内存地址,
						BufferSize--缓存大小
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void SPI_BASIC_Configuration(SPI_TypeDef* SPIx, SPI_InitTypeDef* SPI_InitStruct)							//SPI常规使用方式配置
{
	//1)**********SPI管脚配置及初始化
	SPI_PinSet(SPIx,SPI_InitStruct);																//SPI管脚配置初始化
	//2)**********判断SPI主机是否开启SPI_NSS硬件使能输出	
	//使能SPIx
	SPI_Cmd(SPIx, ENABLE); 
}
void SPI_Server(void)
{
	WOW_Server(); 
}
/*******************************************************************************
*函数名		:	SPI_DMA_Configuration
*功能描述	:	函数功能说明
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void SPI_DMA_Configuration(SPI_TypeDef* SPIx, SPI_InitTypeDef* SPI_InitStruct,u32* SPI_TX_Buffer,u32* SPI_RX_Buffer,u32 SPI_BUFFERSIZE)		//SPI_DMA方式配置
{
/**-----------------------------------------------------------------------------------------------------
	********SPI_DMA的通信过程********
	● 设置外设地址
	● 设置存储器地址
	● 设置传输数据量
	● 设置通道的配置信息
	● 使能DMA通道，启动传输
	
	● 发送时，在每次TXE被设置为’1’时发出DMA请求，DMA控制器则写数据至SPI_DR寄存器，TXE标志因此而被清除。
	● 接收时，在每次RXNE被设置为’1’时发出DMA请求，DMA控制器则从SPI_DR寄存器读出数据，RXNE标志因此而被清除。
-----------------------------------------------------------------------------------------------------**/
	//1)**********定义相关结构体
	DMA_InitTypeDef	DMA_Initstructure;
//	NVIC_InitTypeDef NVIC_Initstructure;
	
//	u32 *SPI_RX_Buffer;
//	u32 *SPI_TX_Buffer;
//	u32 SPI_BUFFERSIZE=5;

	DMA_Channel_TypeDef* DMAx_Channeltx=0;			//DMA发送通道请求信号---当DMA串口发送数据完成时，会发起DMA中断
	DMA_Channel_TypeDef* DMAx_Channelrx=0;			//DMA接收通道请求信号---DMA串口接收由串口发起中断，因此此处接收通道中断不使用
//	u8 DMAx_Channelx_IRQChannel=0;							//DMA中断源
	u8 Conf_Flag=0;															//需要配置标志，如果SPIx合法，则Conf_Flag==1，然后进行下一步DMA配置项
//	u32 DMAx_FLAG_GLtx=0;												//DMA串口发送中断全局变量			
//	u32 DMAx_FLAG_GLrx=0;												//DMA串口接收中断全局变量
	
//	SPI_BUFFERSIZE=BufferSize;
	
//	assert_param(IS_SPI_ALL_PERIPH(SPI5));
	
	//2)**********SPI管脚配置及初始化
	SPI_PinSet(SPIx,SPI_InitStruct);																		//SPI管脚配置初始化
	
	//3)**********SPI通道选择
	if(SPIx==SPI1)
	{
		DMAx_Channeltx=DMA1_Channel3;
		DMAx_Channelrx=DMA1_Channel2;
//		DMAx_Channelx_IRQChannel=DMA1_Channel3_IRQChannel;
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1,ENABLE);
		Conf_Flag=1;																			//需要配置标志，如果SPIx合法，则Conf_Flag==1，然后进行下一步DMA配置项
	}
	else if(SPIx==SPI2)
	{
		DMAx_Channeltx=DMA1_Channel5;
		DMAx_Channelrx=DMA1_Channel4;
//		DMAx_Channelx_IRQChannel=DMA1_Channel5_IRQChannel;
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1,ENABLE);
		Conf_Flag=1;																			//需要配置标志，如果SPIx合法，则Conf_Flag==1，然后进行下一步DMA配置项		
	}
	else if(SPIx==SPI3)
	{
		DMAx_Channeltx=DMA2_Channel2;
		DMAx_Channelrx=DMA2_Channel1;
//		DMAx_Channelx_IRQChannel=DMA2_Channel2_IRQChannel;
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2,ENABLE);
		Conf_Flag=1;																			//需要配置标志，如果SPIx合法，则Conf_Flag==1，然后进行下一步DMA配置项
	}
	else
	{
		Conf_Flag=0;																			//需要配置标志，如果SPIx合法，则Conf_Flag==1，然后进行下一步DMA配置项
	}
	
	//4)**********SPI_DMA配置
	if(Conf_Flag==1)																		//需要配置标志，如果SPIx合法，则Conf_Flag==1，然后进行下一步DMA配置项
	{
		//5)**********DMA发送初始化，外设作为DMA的目的端
		DMA_Initstructure.DMA_PeripheralBaseAddr =  (u32)(&SPIx->DR);						//DMA外设源地址
		DMA_Initstructure.DMA_MemoryBaseAddr     = (u32)SPI_TX_Buffer;							//DMA数据内存地址
		DMA_Initstructure.DMA_DIR = DMA_DIR_PeripheralDST;											//DMA_DIR_PeripheralDST（外设作为DMA的目的端），DMA_DIR_PeripheralSRC（外设作为数据传输的来源）
		DMA_Initstructure.DMA_BufferSize = SPI_BUFFERSIZE; 											//指定DMA通道的DMA缓存的大小
	//	DMA_Initstructure.DMA_BufferSize = sizeof(MemoryAddr[0]); 						//指定DMA通道的DMA缓存的大小
		DMA_Initstructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;				//DMA_PeripheralInc_Enable（外设地址寄存器递增），DMA_PeripheralInc_Disable（外设地址寄存器不变），
		DMA_Initstructure.DMA_MemoryInc =DMA_MemoryInc_Enable;									//DMA_MemoryInc_Enable（内存地址寄存器递增），DMA_MemoryInc_Disable（内存地址寄存器不变）
		DMA_Initstructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;	//外设数据宽度--DMA_PeripheralDataSize_Byte（数据宽度为8位），DMA_PeripheralDataSize_HalfWord（数据宽度为16位），DMA_PeripheralDataSize_Word（数据宽度为32位）
		DMA_Initstructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;					//内存数据宽度--DMA_MemoryDataSize_Byte（数据宽度为8位），DMA_MemoryDataSize_HalfWord（数据宽度为16位），DMA_MemoryDataSize_Word（数据宽度为32位）
		DMA_Initstructure.DMA_Mode = DMA_Mode_Normal;														//DMA工作模式--DMA_Mode_Normal（只传送一次）, DMA_Mode_Circular（不停地传送）
		DMA_Initstructure.DMA_Priority = DMA_Priority_High; 										//DMA通道的转输优先级--DMA_Priority_VeryHigh（非常高）DMA_Priority_High（高)，DMA_Priority_Medium（中），DMA_Priority_Low（低）
		DMA_Initstructure.DMA_M2M = DMA_M2M_Disable;														//DMA通道的内存到内存传输--DMA_M2M_Enable(设置为内存到内存传输)，DMA_M2M_Disable（非内存到内存传输）
		DMA_Init(DMAx_Channeltx,&DMA_Initstructure);														//初始化DMA

		//6)**********DMA接收初始化，外设作为DMA的源端
		DMA_Initstructure.DMA_PeripheralBaseAddr =  (u32)(&SPIx->DR);					//DMA外设源地址
		DMA_Initstructure.DMA_MemoryBaseAddr     = 	(u32)SPI_RX_Buffer;						//DMA数据内存地址
		DMA_Initstructure.DMA_DIR = DMA_DIR_PeripheralSRC;											//DMA_DIR_PeripheralDST（外设作为DMA的目的端），DMA_DIR_PeripheralSRC（外设作为数据传输的来源）
		DMA_Initstructure.DMA_BufferSize = SPI_BUFFERSIZE; 													//指定DMA通道的DMA缓存的大小
	//	DMA_Initstructure.DMA_BufferSize = sizeof(MemoryAddr); 								//指定DMA通道的DMA缓存的大小
		DMA_Initstructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;				//DMA_PeripheralInc_Enable（外设地址寄存器递增），DMA_PeripheralInc_Disable（外设地址寄存器不变），
		DMA_Initstructure.DMA_MemoryInc =DMA_MemoryInc_Enable;									//DMA_MemoryInc_Enable（内存地址寄存器递增），DMA_MemoryInc_Disable（内存地址寄存器不变）
		DMA_Initstructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;	//外设数据宽度--DMA_PeripheralDataSize_Byte（数据宽度为8位），DMA_PeripheralDataSize_HalfWord（数据宽度为16位），DMA_PeripheralDataSize_Word（数据宽度为32位）
		DMA_Initstructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;					//内存数据宽度--DMA_MemoryDataSize_Byte（数据宽度为8位），DMA_MemoryDataSize_HalfWord（数据宽度为16位），DMA_MemoryDataSize_Word（数据宽度为32位）
		DMA_Initstructure.DMA_Mode = DMA_Mode_Normal;														//DMA工作模式--DMA_Mode_Normal（只传送一次）, DMA_Mode_Circular（不停地传送）
		DMA_Initstructure.DMA_Priority = DMA_Priority_High; 										//DMA通道的转输优先级--DMA_Priority_VeryHigh（非常高）DMA_Priority_High（高)，DMA_Priority_Medium（中），DMA_Priority_Low（低）
		DMA_Initstructure.DMA_M2M = DMA_M2M_Disable;														//DMA通道的内存到内存传输--DMA_M2M_Enable(设置为内存到内存传输)，DMA_M2M_Disable（非内存到内存传输）
		DMA_Init(DMAx_Channelrx,&DMA_Initstructure);														//初始化DMA
		
//		//7)**********DMA通道中断初始化---此为DMA发送中断----DMA发送完成中断
//		NVIC_Initstructure.NVIC_IRQChannel = DMA1_Channel4_IRQChannel;       		//通道设置为串口1中断
//		NVIC_Initstructure.NVIC_IRQChannelPreemptionPriority=1;
//		NVIC_Initstructure.NVIC_IRQChannelSubPriority = 1; 			//中断响应优先级0	
//		NVIC_Initstructure.NVIC_IRQChannelCmd = ENABLE;        									//打开中断
//		NVIC_Init(&NVIC_Initstructure);
//		
//		DMA_ITConfig(DMA1_Channel4, DMA_IT_TC, ENABLE);	//使能或者失能指定的通道x中断
//		DMA_Cmd(DMA1_Channel4, ENABLE);
			
		SPI_I2S_DMACmd(SPIx, SPI_I2S_DMAReq_Tx, ENABLE);
		SPI_I2S_DMACmd(SPIx, SPI_I2S_DMAReq_Rx, ENABLE);
		
		
		
		
