wegam/STM32F10xUSBF/FWLIB/Lib/WOWLIB/SCR/STM32_SPI - 20170726.C
		//使能SPIx
		SPI_Cmd(SPIx, ENABLE);
		
		//9.2)**********使能相关DMA通道传输完成中断
//		DMA_ITConfig(DMAx_Channeltx,DMA_IT_TC, ENABLE);
			/* 启动DMA1通道5*/
		DMA_Cmd(DMAx_Channelrx,DISABLE);	
		DMA_Cmd(DMAx_Channeltx,DISABLE);
		

		//9.2)**********使能相关DMA通道传输完成中断
//		DMA_ITConfig(DMAx_Channeltx,DMA_IT_TC, ENABLE);
	}
		
//	NVIC_Initstructure.NVIC_IRQChannel = SPI_I2S_IT_TXE;       		//通道设置为串口1中断
//	NVIC_Initstructure.NVIC_IRQChannelPreemptionPriority=1;
//	NVIC_Initstructure.NVIC_IRQChannelSubPriority = 1; 			//中断响应优先级0	
//	NVIC_Initstructure.NVIC_IRQChannelCmd = ENABLE;        									//打开中断
//	NVIC_Init(&NVIC_Initstructure);
//	
//	SPI_I2S_ITConfig(SPIx,SPI_I2S_IT_TXE,ENABLE);
	
	//使能SPIx
	SPI_Cmd(SPIx, DISABLE);
}
/*******************************************************************************
*函数名		:	SPI_PinSet
*功能描述	:	SPI管脚配置初始化
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void SPI_PinSet(SPI_TypeDef* SPIx, SPI_InitTypeDef* SPI_InitStruct)													//SPI管脚配置及初始化
{
	//1)**********定义相关结构体
//	SPI_InitTypeDef  SPI_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	//2)**********相关GPIO配置
	if(SPIx==SPI1)
	{
		//2.1)**********打开SPI时钟	
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1 ,ENABLE);	
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO|RCC_APB2Periph_GPIOA, ENABLE);		
	
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_Init(GPIOA, &GPIO_InitStructure);
		
		if(SPI_InitStruct->SPI_NSS == SPI_NSS_Soft)			//如果SPI_NSS为SPI_NSS_Soft（软件控制方式）
		{
			
			//2.2)**********SPI_NSS_Hard配置
			GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
			GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
			GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
			GPIO_Init(GPIOA, &GPIO_InitStructure);
		}
	}
	else if(SPIx==SPI2)
	{
		//2.2)**********打开SPI时钟
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2 ,ENABLE);			
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO|RCC_APB2Periph_GPIOB, ENABLE);
		
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;  //复用推挽输出
		GPIO_Init(GPIOB, &GPIO_InitStructure);	
		
		if(SPI_InitStruct->SPI_NSS == SPI_NSS_Soft)			//如果SPI_NSS为SPI_NSS_Soft（软件控制方式）
		{
			//2.2)**********SPI_NSS配置
			GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
			GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
			GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;  //复用推挽输出
			GPIO_Init(GPIOB, &GPIO_InitStructure);
		}
	}
		else if(SPIx==SPI3)
	{
		//2.2)**********打开SPI时钟
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI3 ,ENABLE);			
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO|RCC_APB2Periph_GPIOA|RCC_APB2Periph_GPIOB, ENABLE);
		
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;  //复用推挽输出
		GPIO_Init(GPIOB, &GPIO_InitStructure);
		
		if(SPI_InitStruct->SPI_NSS == SPI_NSS_Soft)			//如果SPI_NSS为SPI_NSS_Soft（软件控制方式）
		{			
			//2.2)**********SPI_NSS配置		
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;  //复用推挽输出
		GPIO_Init(GPIOA, &GPIO_InitStructure);
		}
		else	
		{			
			//2.2)**********SPI_NSS配置
			GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
			GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
			GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;  //复用推挽输出
			GPIO_Init(GPIOA, &GPIO_InitStructure);
		}			
	}
	//3)**********SPI配置选项
//	SPI_InitStruct->SPI_Direction = SPI_Direction_2Lines_FullDuplex;				//设置方向				（2线全双工、2线只接收、一线发送、一线接收）
//	SPI_InitStruct->SPI_Mode = SPI_Mode_Master;															//模式         	（从或主设备）
//	SPI_InitStruct->SPI_DataSize = SPI_DataSize_8b;													//宽度         	（8或16位）
//	SPI_InitStruct->SPI_CPOL = SPI_CPOL_High;																//时钟极性     	（低或高）
//	SPI_InitStruct->SPI_CPHA = SPI_CPHA_2Edge;															//时钟相位     	（第一个或第二个跳变沿）
////	SPI_InitStructure->SPI_NSS = SPI_NSS_Soft;																	//片选方式     	（硬件或软件方式）
//	SPI_InitStruct->SPI_NSS = SPI_NSS_Hard;																	//片选方式     	（硬件或软件方式）
//	SPI_InitStruct->SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_32;				//波特率预分频 	（从2---256分频）
//	SPI_InitStruct->SPI_FirstBit = SPI_FirstBit_MSB;												//最先发送的位 	（最低位，还是最高位在先）
//	SPI_InitStruct->SPI_CRCPolynomial = 7;																	//设置crc多项式	（数字）如7
	SPI_Init(SPIx, SPI_InitStruct);	
	
	//3)**********使能SPIx_NESS为主输出模式
	if((SPIx->CR1&0X0200)!=SPI_NSS_Soft)						//如果在主机模式下的片选方式为硬件（SPI_NSS_Hard）方式，此处必须打开，否则NSS无信号
	{
		SPI_SSOutputCmd(SPIx, ENABLE);
	}

}
/*******************************************************************************
*函数名		: function
*功能描述	:	SPI_DMA发送函数
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:	USART_DMASend(USART2,"中文ENG=%d\n",num);
*特别说明	:	在DMA发送完成后需要释放动态空间，free(USART_BUFFER);
					:	USART_BUFFER定义在STM32_USART.H
*******************************************************************************/
int SPI_DMAPrintf(SPI_TypeDef* SPIx,const char *format,...)		//SPI_DMA发送函数----后边的省略号就是可变参数
{
	
//		va_list ap; 										//VA_LIST 是在C语言中解决变参问题的一组宏，所在头文件：#include <stdarg.h>,用于获取不确定个数的参数
//    static char string[ 256 ];			//定义数组，
//    va_start( ap, format );
//    vsprintf( string , format, ap );    
//    va_end( ap );
//	char *SPI_BUFFER;
	//1)**********获取数据宽度
	u16 num=strlen((const char*)format);		//获取数据宽度
	//2)**********定义缓冲区大小变量
	unsigned int BufferSize;
	//3)**********args为定义的一个指向可变参数的变量，va_list以及下边要用到的va_start,va_end都是是在定义，可变参数函数中必须要用到宏， 在stdarg.h头文件中定义
	va_list args;                                        
	//4)**********申请动态空间
	SPI_BUFFER = (char*)malloc(sizeof(char) * num);	
	//5)**********初始化args的函数，使其指向可变参数的第一个参数，format是可变参数的前一个参数
	va_start(args, format);
	//6)**********正常情况下返回生成字串的长度(除去\0),错误情况返回负值
	BufferSize = vsprintf(SPI_BUFFER, format, args);
	//7)**********结束可变参数的获取
	va_end(args);                                      		
	//8)**********将等发送缓冲区大小（数据个数）及缓冲区地址发给DMA开启发送
	//8)**********DMA发送完成后注意应该释放缓冲区：free(USART_BUFFER);
	if(SPIx==SPI1)
	{
		DMA1_Channel3->CNDTR =BufferSize;										//设定待发送缓冲区大小
		DMA1_Channel3->CMAR =(u32)SPI_BUFFER;							//发送缓冲区	
		DMA_Cmd(DMA1_Channel3,ENABLE);											//DMA发送开启3
	}
	else if(SPIx==SPI2)
	{
		DMA1_Channel5->CNDTR =BufferSize;										//设定待发送缓冲区大小
		DMA1_Channel5->CMAR =(u32)SPI_BUFFER;							//发送缓冲区	
		DMA_Cmd(DMA1_Channel5,ENABLE);											//DMA发送开启3
	}
	else if(SPIx==SPI3)
	{
		DMA2_Channel2->CNDTR =BufferSize;										//设定待发送缓冲区大小
		DMA2_Channel2->CMAR =(u32)SPI_BUFFER;							//发送缓冲区	
		DMA_Cmd(DMA2_Channel2,ENABLE);											//DMA发送开启3
	}
	return BufferSize;
}
/*******************************************************************************
*函数名		: function
*功能描述	:	SPI_DMA发送函数
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:	USART_DMASend(USART2,"中文ENG=%d\n",num);
*特别说明	:	在DMA发送完成后需要释放动态空间，free(USART_BUFFER);
					:	USART_BUFFER定义在STM32_USART.H
*******************************************************************************/
int SPI_DMA_BufferWrite(SPI_TypeDef* SPIx,u32 *SPI_TX_Buffer,u16 BufferSize)		//SPI_DMA发送函数----后边的省略号就是可变参数
{              		
	//8)**********将等发送缓冲区大小（数据个数）及缓冲区地址发给DMA开启发送
	//8)**********DMA发送完成后注意应该释放缓冲区：free(USART_BUFFER);
	if(SPIx==SPI1)
	{
		DMA1_Channel3->CNDTR =BufferSize;										//设定待发送缓冲区大小
		DMA1_Channel3->CMAR =(u32)SPI_TX_Buffer;						//发送缓冲区	
//		DMA1_Channel2->CNDTR =BufferSize;										//设定待发送缓冲区大小
//		DMA1_Channel2->CMAR =(u32)SPI_RX_Buffer;						//发送缓冲区	
//		DMA_Cmd(DMA1_Channel2,ENABLE);
		DMA_Cmd(DMA1_Channel3,ENABLE);											//DMA发送开启3
	}
	else if(SPIx==SPI2)
	{
		DMA1_Channel5->CNDTR =BufferSize;										//设定待发送缓冲区大小
		DMA1_Channel5->CMAR =(u32)SPI_TX_Buffer;							//发送缓冲区	
		DMA_Cmd(DMA1_Channel5,ENABLE);											//DMA发送开启3
	}
	else if(SPIx==SPI3)
	{
		DMA1_Channel2->CNDTR =BufferSize;										//设定待发送缓冲区大小
		DMA1_Channel2->CMAR =(u32)SPI_TX_Buffer;							//发送缓冲区	
		DMA_Cmd(DMA2_Channel2,ENABLE);											//DMA发送开启3
	}
	return BufferSize;
}
/*******************************************************************************
*函数名		: function
*功能描述	:	SPI_DMA_BufferRead发送函数
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:	USART_DMASend(USART2,"中文ENG=%d\n",num);
*特别说明	:	在DMA发送完成后需要释放动态空间，free(USART_BUFFER);
					:	USART_BUFFER定义在STM32_USART.H
*******************************************************************************/
void SPI_DMA_BufferRead(u32 *ReadAddr)
{
	SPI_InitTypeDef  SPI_InitStructure;
	
