wegam/STM32F10xUSBF/FWLIB/Lib/WOWLIB/SCR/STM32_SPI - 20170726.C
	GPIO_ResetBits(GPIOA,GPIO_Pin_4);
	/* Send "Read from Memory " instruction */
	SPI_I2S_SendData(SPI1,0X9F);
	
	while(SPI_I2S_GetFlagStatus(SPI1,SPI_I2S_FLAG_TXE) == RESET);
	
	SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_RxOnly;
	SPI_Init(SPI1, &SPI_InitStructure);

	DMA1_Channel2->CNDTR =20;						//发送缓冲区
	DMA1_Channel2->CMAR =(u32)ReadAddr;						//发送缓冲区

	//SPI_FLASH_SendByte(0xff);
	SPI_I2S_DMACmd(SPI1, SPI_I2S_DMAReq_Rx, ENABLE);

	while(DMA_GetFlagStatus(DMA1_FLAG_TC2) == RESET);
	GPIO_SetBits(GPIOA,GPIO_Pin_4);
}
/*******************************************************************************
*函数名		:	SPI_RX_FlagClear
*功能描述	:	函数功能说明
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
u32 SPI_RX_FlagClear(SPI_TypeDef* SPIx)											//SPI DMA配置及初始化
{
	u32 num=0;
	if(SPIx==SPI1)
	{
	}
	else if(SPIx==SPI2)
	{
	}
	else if(SPIx==SPI3)
	{
	}
	else
	{
		num=0;
	}
	return num;
}
/*******************************************************************************
*函数名		:	SPI_TX_DMAFlagClear
*功能描述	:	清除SPI_DMA发送完成中断标志
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
ErrorStatus SPI_TX_DMAFlagClear(SPI_TypeDef* SPIx)					//清除SPI_DMA发送完成中断标志
{
	ErrorStatus status = ERROR;
	if(SPIx==SPI1)
	{
		if(DMA_GetITStatus(DMA1_IT_TC3))
		{
			DMA_ClearFlag(DMA1_IT_TC3);
			DMA_Cmd(DMA1_Channel3,DISABLE);			//DMA发送关闭
			status = SUCCESS;
		}
		else
		{
			status = ERROR;
		}
	}
	else if(SPIx==SPI2)
	{
		if(DMA_GetITStatus(DMA1_IT_TC5))
		{
			DMA_ClearFlag(DMA1_IT_TC5);
			DMA_Cmd(DMA1_Channel5,DISABLE);			//DMA发送关闭
			status = SUCCESS;
		}
		else
		{
			status = ERROR;
		}
	}
	else if(SPIx==SPI3)
	{
		if(DMA_GetITStatus(DMA2_IT_TC2))
		{
			DMA_ClearFlag(DMA2_IT_TC2);
			DMA_Cmd(DMA2_Channel2,DISABLE);			//DMA发送关闭
			status = SUCCESS;
		}
		else
		{
			status = ERROR;
		}
	}
	else
	{
		status = ERROR;
	}
	return status;
}
/*******************************************************************************
*函数名		:	
*功能描述	:	
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
u8 SPI_SendByte(u8 byte)
{
  /* 等待DR寄存器空 */
  while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);

  /* Send byte through the SPI1 peripheral */
  SPI_I2S_SendData(SPI1, byte);

  /* Wait to receive a byte */
  while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET);

  /* Return the byte read from the SPI bus */
  return SPI_I2S_ReceiveData(SPI1);
}

/*********************************************************************************************************************/
/*******************************************************************************
*函数名		:	
*功能描述	:	
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
//unsigned char SPI_Read(unsigned char* data,unsigned char bytesNumber)
// {
//     unsigned char byte = 0;
//     for(byte = 0; byte < bytesNumber; byte++)
//     {
//				SPI_Buffer_Tx[byte]=0;
//     }
//     GPIO_ResetBits(GPIOB,GPIO_Pin_12);
//     SPI2_ReceiveSendByte(bytesNumber);
//     GPIO_SetBits(GPIOB, GPIO_Pin_12);
//     for(byte = 0; byte < bytesNumber; byte++)
//     {
//				data[byte]=SPI_Buffer_Rx[byte];
//     }
//     return bytesNumber;
// }
/*******************************************************************************
*函数名		:	
*功能描述	:	
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
 void SPI_DMA_ReceiveSendByte(SPI_TypeDef* SPIx,u16 num)			//DMA收发数据
 {
	SPI_Cmd(SPIx, ENABLE);
	SPI_DMA_Conf(SPIx,num);											//设置SPI_DMA：设置缓存大小及清除DMA标志

	SPIx->DR ;             											//接送前读一次SPI1->DR，保证接收缓冲区为空

	while((SPIx->SR&1<<1)==0);										//TXE：等待发送缓冲为空 (Transmit buffer empty)
	SPI_DMA_Cmd(SPIx,ENABLE);										//SPI_DMA使能或者失能---开启DMA

//     while( !DMA_GetFlagStatus(DMA1_FLAG_TC4));		//等待接收完成
	while(SPI_DMA_TX_Flag(SPI1)==0);					//查询SPI_DMA接收完成标志;0--未完成，1--完成
	 
	SPI_DMA_Cmd(SPIx,DISABLE);										//SPI_DMA使能或者失能---关闭DMA
	SPI_Cmd(SPIx, DISABLE);
 }
/*******************************************************************************
*函数名		:	SPI_DMA_Conf
*功能描述	:	设置SPI_DMA：设置缓存大小及清除DMA标志
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void SPI_DMA_Conf(SPI_TypeDef* SPIx,u16 num)		//设置SPI_DMA：设置缓存大小及清除DMA标志
{
	if(SPIx==SPI1)
	{
		//1)**********设置缓存大小
		DMA1_Channel3->CNDTR =num;										//设定待发送缓冲区大小
		DMA1_Channel2->CNDTR =num;										//设定待接收缓冲区大小
		//2)**********清除DMA标志
		DMA_ClearFlag(DMA1_FLAG_GL3|DMA1_FLAG_TC3|DMA1_FLAG_HT3|DMA1_FLAG_TE3);		//清除DMA发送标志
		DMA_ClearFlag(DMA1_FLAG_GL2|DMA1_FLAG_TC2|DMA1_FLAG_HT2|DMA1_FLAG_TE2);		//清除DMA接收标志
	}
	else if(SPIx==SPI2)
	{
		//1)**********设置缓存大小
		DMA1_Channel5->CNDTR =num;										//设定待发送缓冲区大小
		DMA1_Channel4->CNDTR =num;										//设定待接收缓冲区大小
		//2)**********清除DMA标志
		DMA_ClearFlag(DMA1_FLAG_GL5|DMA1_FLAG_TC5|DMA1_FLAG_HT5|DMA1_FLAG_TE5);		//清除DMA发送标志
		DMA_ClearFlag(DMA1_FLAG_GL4|DMA1_FLAG_TC4|DMA1_FLAG_HT4|DMA1_FLAG_TE4);		//清除DMA接收标志
	}
	else if(SPIx==SPI3)
	{
		//1)**********设置缓存大小
		DMA2_Channel2->CNDTR =num;										//设定待发送缓冲区大小
		DMA2_Channel1->CNDTR =num;										//设定待接收缓冲区大小
		//2)**********清除DMA标志
		DMA_ClearFlag(DMA2_FLAG_GL2|DMA2_FLAG_TC2|DMA2_FLAG_HT2|DMA2_FLAG_TE2);		//清除DMA发送标志
		DMA_ClearFlag(DMA2_FLAG_GL1|DMA2_FLAG_TC1|DMA2_FLAG_HT1|DMA2_FLAG_TE1);		//清除DMA接收标志
	}
}
/*******************************************************************************
*函数名		:	function
*功能描述	:	SPI_DMA使能或者失能
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void SPI_DMA_Cmd(SPI_TypeDef* SPIx,FunctionalState NewState)		//SPI_DMA使能或者失能
{
	//1)使能SPI_DMA通道
	if (NewState != DISABLE)
	{
		if(SPIx==SPI1)
		{
			DMA_Cmd(DMA1_Channel3, ENABLE);
			DMA_Cmd(DMA1_Channel2, ENABLE);
		}
		else if(SPIx==SPI2)
		{
			DMA_Cmd(DMA1_Channel5, ENABLE);
			DMA_Cmd(DMA1_Channel4, ENABLE);
		}
		else if(SPIx==SPI3)
		{
			DMA_Cmd(DMA2_Channel2, ENABLE);
			DMA_Cmd(DMA2_Channel1, ENABLE);
		}
	}
	//2)关闭SPI_DMA通道
	else
	{
		if(SPIx==SPI1)
		{
			DMA_Cmd(DMA1_Channel3, DISABLE);
			DMA_Cmd(DMA1_Channel2, DISABLE);
		}
		else if(SPIx==SPI2)
		{
			DMA_Cmd(DMA1_Channel5, DISABLE);
			DMA_Cmd(DMA1_Channel4, DISABLE);
		}
		else if(SPIx==SPI3)
		{
			DMA_Cmd(DMA2_Channel2, DISABLE);
			DMA_Cmd(DMA2_Channel1, DISABLE);
		}
	}
}
/*******************************************************************************
*函数名		:	SPI_DMA_TX_Flag
*功能描述	:	查询SPI_DMA接收完成标志
*输入			: 
*输出			:	无
*返回值		:	0--未完成，1--完成
*例程			:
*******************************************************************************/
unsigned char SPI_DMA_TX_Flag(SPI_TypeDef* SPIx)		//查询SPI_DMA接收完成标志
{
	u8 DMA_TX_Complete_Flag=0;							//DMA通道传输完成标志变量，0--未完成，1--完成
	if(SPIx==SPI1)
	{
		if(DMA_GetFlagStatus(DMA1_FLAG_TC2)!=RESET)		//传输完成
		{
			DMA_TX_Complete_Flag=1;							//DMA通道传输完成标志变量，0--未完成，1--完成
			
			//2)**********清除DMA标志
		DMA_ClearFlag(DMA1_FLAG_GL3|DMA1_FLAG_TC3|DMA1_FLAG_HT3|DMA1_FLAG_TE3);		//清除DMA发送标志
		DMA_ClearFlag(DMA1_FLAG_GL2|DMA1_FLAG_TC2|DMA1_FLAG_HT2|DMA1_FLAG_TE2);		//清除DMA接收标志
			
