wegam/STM32F10xUSBF/FWLIB/Lib/WOWLIB/SCR/STM32_SPI - 20170726.C
		}
		else		//传输未完成
		{
			DMA_TX_Complete_Flag=0;							//DMA通道传输完成标志变量，0--未完成，1--完成
		}
	}
	else if(SPIx==SPI2)
	{
		if(DMA_GetFlagStatus(DMA1_FLAG_TC4)!=RESET)
		{
			DMA_TX_Complete_Flag=1;							//DMA通道传输完成标志变量，0--未完成，1--完成
			
			//2)**********清除DMA标志
		DMA_ClearFlag(DMA1_FLAG_GL5|DMA1_FLAG_TC5|DMA1_FLAG_HT5|DMA1_FLAG_TE5);		//清除DMA发送标志
		DMA_ClearFlag(DMA1_FLAG_GL4|DMA1_FLAG_TC4|DMA1_FLAG_HT4|DMA1_FLAG_TE4);		//清除DMA接收标志
		}
		else		//传输未完成
		{
			DMA_TX_Complete_Flag=0;							//DMA通道传输完成标志变量，0--未完成，1--完成
		}
	}
	else if(SPIx==SPI3)
	{
		if(DMA_GetFlagStatus(DMA2_FLAG_TC1)!=RESET)
		{
			DMA_TX_Complete_Flag=1;							//DMA通道传输完成标志变量，0--未完成，1--完成
			
			//2)**********清除DMA标志
		DMA_ClearFlag(DMA2_FLAG_GL2|DMA2_FLAG_TC2|DMA2_FLAG_HT2|DMA2_FLAG_TE2);		//清除DMA发送标志
		DMA_ClearFlag(DMA2_FLAG_GL1|DMA2_FLAG_TC1|DMA2_FLAG_HT1|DMA2_FLAG_TE1);		//清除DMA接收标志
		}
		else		//传输未完成
		{
			DMA_TX_Complete_Flag=0;							//DMA通道传输完成标志变量，0--未完成，1--完成
		}
	}
	return	DMA_TX_Complete_Flag;							//DMA通道传输完成标志变量，0--未完成，1--完成

}

void SPI2_Conf_TEST(u32* SPI_TX_Buffer,u32* SPI_RX_Buffer,u32 SPI_BUFFERSIZE)
{
	DMA_InitTypeDef  DMA_InitStructure;
	SPI_InitTypeDef  SPI_InitStructure;
	NVIC_InitTypeDef NVIC_Initstructure;
	EXTI_InitTypeDef EXTI_Initstructure;
	
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE); 

	SPI_InitStructure.SPI_Direction=SPI_Direction_2Lines_FullDuplex;			//设置方向				（2线全双工、2线只接收、一线发送、一线接收）
//	SPI_InitStructure.SPI_Direction=SPI_Direction_1Line_Rx;			//设置方向				（只读）
//	SPI_InitStructure.SPI_Mode=SPI_Mode_Master;														//模式         	（从或主设备）
	SPI_InitStructure.SPI_Mode=SPI_Mode_Slave;													//模式         	（从或主设备）
	SPI_InitStructure.SPI_DataSize=SPI_DataSize_8b;												//宽度         	（8或16位）
//	SPI_InitStructure.SPI_CPOL=SPI_CPOL_High;															//时钟极性     	（低或高）
	SPI_InitStructure.SPI_CPOL=SPI_CPOL_Low;															//时钟极性     	（低或高）
	SPI_InitStructure.SPI_CPHA=SPI_CPHA_2Edge;														//时钟相位     	（第一个或第二个跳变沿）
//	SPI_InitStructure.SPI_CPHA=SPI_CPHA_1Edge;														//时钟相位     	（第一个或第二个跳变沿）
//	SPI_InitStructure.SPI_NSS=SPI_NSS_Soft;															//片选方式     	（硬件或软件方式）软件控制
	SPI_InitStructure.SPI_NSS=SPI_NSS_Hard;																//片选方式     	（硬件或软件方式）硬件控制
	SPI_InitStructure.SPI_BaudRatePrescaler=SPI_BaudRatePrescaler_4;		//波特率预分频 	（从2---256分频）
	SPI_InitStructure.SPI_FirstBit=SPI_FirstBit_MSB;											//最先发送的位 	（最低位，还是最高位在先）
	SPI_InitStructure.SPI_CRCPolynomial=0X07;															//设置crc多项式	（其复位值为0x0007，根据应用可以设置其他数值。）
	
	SPI_Init(SPI2, &SPI_InitStructure);
	
	
	SPI_Cmd(SPI2, ENABLE);

	SPI_PinSet(SPI2,&SPI_InitStructure);	
	
	
	
	//5)**********DMA发送初始化，外设作为DMA的目的端
	DMA_InitStructure.DMA_PeripheralBaseAddr =  (u32)(&SPI2->DR);						//DMA外设源地址
	DMA_InitStructure.DMA_MemoryBaseAddr     = (u32)SPI_TX_Buffer;							//DMA数据内存地址
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;											//DMA_DIR_PeripheralDST（外设作为DMA的目的端），DMA_DIR_PeripheralSRC（外设作为数据传输的来源）
	DMA_InitStructure.DMA_BufferSize = SPI_BUFFERSIZE; 													//指定DMA通道的DMA缓存的大小
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;				//DMA_PeripheralInc_Enable（外设地址寄存器递增），DMA_PeripheralInc_Disable（外设地址寄存器不变），
	DMA_InitStructure.DMA_MemoryInc =DMA_MemoryInc_Enable;									//DMA_MemoryInc_Enable（内存地址寄存器递增），DMA_MemoryInc_Disable（内存地址寄存器不变）
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;	//外设数据宽度--DMA_PeripheralDataSize_Byte（数据宽度为8位），DMA_PeripheralDataSize_HalfWord（数据宽度为16位），DMA_PeripheralDataSize_Word（数据宽度为32位）
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;					//内存数据宽度--DMA_MemoryDataSize_Byte（数据宽度为8位），DMA_MemoryDataSize_HalfWord（数据宽度为16位），DMA_MemoryDataSize_Word（数据宽度为32位）
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;														//DMA工作模式--DMA_Mode_Normal（只传送一次）, DMA_Mode_Circular（不停地传送）
	DMA_InitStructure.DMA_Priority = DMA_Priority_High; 										//DMA通道的转输优先级--DMA_Priority_VeryHigh（非常高）DMA_Priority_High（高)，DMA_Priority_Medium（中），DMA_Priority_Low（低）
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;														//DMA通道的内存到内存传输--DMA_M2M_Enable(设置为内存到内存传输)，DMA_M2M_Disable（非内存到内存传输）
	DMA_Init(DMA1_Channel5,&DMA_InitStructure);														//初始化DMA
		
//6)**********DMA接收初始化，外设作为DMA的源端--SPI接收
	DMA_InitStructure.DMA_PeripheralBaseAddr =  (u32)&SPI2->DR;					//DMA外设源地址
	DMA_InitStructure.DMA_MemoryBaseAddr     = 	(u32)SPI_RX_Buffer;						//DMA数据内存地址
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;											//DMA_DIR_PeripheralDST（外设作为DMA的目的端），DMA_DIR_PeripheralSRC（外设作为数据传输的来源）
	DMA_InitStructure.DMA_BufferSize = SPI_BUFFERSIZE; 													//指定DMA通道的DMA缓存的大小
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;				//DMA_PeripheralInc_Enable（外设地址寄存器递增），DMA_PeripheralInc_Disable（外设地址寄存器不变），
	DMA_InitStructure.DMA_MemoryInc =DMA_MemoryInc_Enable;									//DMA_MemoryInc_Enable（内存地址寄存器递增），DMA_MemoryInc_Disable（内存地址寄存器不变）
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;	//外设数据宽度--DMA_PeripheralDataSize_Byte（数据宽度为8位），DMA_PeripheralDataSize_HalfWord（数据宽度为16位），DMA_PeripheralDataSize_Word（数据宽度为32位）
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;					//内存数据宽度--DMA_MemoryDataSize_Byte（数据宽度为8位），DMA_MemoryDataSize_HalfWord（数据宽度为16位），DMA_MemoryDataSize_Word（数据宽度为32位）
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;														//DMA工作模式--DMA_Mode_Normal（只传送一次）, DMA_Mode_Circular（不停地传送）
	DMA_InitStructure.DMA_Priority = DMA_Priority_High; 										//DMA通道的转输优先级--DMA_Priority_VeryHigh（非常高）DMA_Priority_High（高)，DMA_Priority_Medium（中），DMA_Priority_Low（低）
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;														//DMA通道的内存到内存传输--DMA_M2M_Enable(设置为内存到内存传输)，DMA_M2M_Disable（非内存到内存传输）
	DMA_Init(DMA1_Channel4, &DMA_InitStructure);														//初始化DMA


//	//7)**********DMA通道中断初始化---此为DMA发送中断----DMA发送完成中断
//	NVIC_Initstructure.NVIC_IRQChannel = SPI2_IRQChannel;       		//通道设置为串口1中断
//	NVIC_Initstructure.NVIC_IRQChannelPreemptionPriority=1;
//	NVIC_Initstructure.NVIC_IRQChannelSubPriority = 1; 			//中断响应优先级0	
//	NVIC_Initstructure.NVIC_IRQChannelCmd = ENABLE;        									//打开中断
//	NVIC_Init(&NVIC_Initstructure);
//	SPI_I2S_ITConfig(SPI2,SPI_I2S_IT_RXNE, ENABLE);			//接收完成中断

	
