wegam/STM32F10xUSBF/FWLIB/Lib/WOWLIB/SCR/STM32_SPI - 20170726.C
	//NSS上升沿中断************************************************************************
	EXTI_Configuration(GPIOB,GPIO_Pin_12,EXTI_Mode_Interrupt);
	
	EXTI_Initstructure.EXTI_Trigger=EXTI_Trigger_Rising;					//触发方式-
	EXTI_Initstructure.EXTI_LineCmd=ENABLE;												//连接使能
	EXTI_Init(&EXTI_Initstructure);
	
	EXTI_GenerateSWInterrupt(EXTI_Line12);													//使能中断


	GPIO_EXTILineConfig(GPIO_PortSourceGPIOB,GPIO_PinSource12);

	
	EXTI_Initstructure.EXTI_Line=EXTI_Line12;												//外部中断线路
	EXTI_Initstructure.EXTI_Mode=EXTI_Mode_Interrupt;						//中断模式
//	EXTI_Initstructure.EXTI_Mode=EXTI_Mode_Event;						//中断模式
	EXTI_Initstructure.EXTI_Trigger=EXTI_Trigger_Rising;					//触发方式-
	EXTI_Initstructure.EXTI_LineCmd=ENABLE;												//连接使能
	EXTI_Init(&EXTI_Initstructure);
	
	EXTI_GenerateSWInterrupt(EXTI_Line12);													//使能中断
	
	//7)**********配置中断
	NVIC_Initstructure.NVIC_IRQChannel = EXTI15_10_IRQChannel;					//选择中断通道-中断源
	NVIC_Initstructure.NVIC_IRQChannelPreemptionPriority = 0;			//抢占优先级
	NVIC_Initstructure.NVIC_IRQChannelSubPriority = 0;						//响应优先级
	NVIC_Initstructure.NVIC_IRQChannelCmd = ENABLE;								//使能
	NVIC_Init(&NVIC_Initstructure);	

	EXTI_GenerateSWInterrupt(EXTI_Line12);													//使能中断
	EXTI_ClearITPendingBit(EXTI_Line12);
	//NSS上升沿中断************************************************************************	
	
	SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Tx, ENABLE);	
	SPI_I2S_DMACmd(SPI2, SPI_I2S_DMAReq_Rx, ENABLE);
	
	DMA_Cmd(DMA1_Channel5,ENABLE);			//SPI-TX
	DMA_Cmd(DMA1_Channel4,ENABLE);			//SPI-RX
	
	SPI_Cmd(SPI2, ENABLE);
	
	

}



/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void SPI_Configuratio(SPI_TypeDef* SPIx)
{

}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void SPI_General_Configuratio(void)
{

}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void SPI_GPIO_Configuratio(SPI_TypeDef* SPIx)
{


}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void SPI_DMA_Configuratio(SPI_TypeDef* SPIx)
{

}

























